{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 216, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "DataAugmentation", "config": {"name": "data_augmentation", "trainable": true, "dtype": "float32", "norm": {"class_name": "Normalization", "config": {"name": "normalization", "trainable": true, "batch_input_shape": [null, null, null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}, "__passive_serialization__": true}, "SIZE": 216}, "name": "data_augmentation", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Patches", "config": {"name": "patches", "trainable": true, "dtype": "float32", "path-size": 27}, "name": "patches", "inbound_nodes": [[["data_augmentation", 0, 0, {}]]]}, {"class_name": "PatchEncoder", "config": {"name": "patch_encoder", "trainable": true, "dtype": "float32", "num_paches": 64, "d": 32}, "name": "patch_encoder", "inbound_nodes": [[["patches", 0, 0, {}]]]}, {"class_name": "Transformer", "config": {"name": "transformer", "trainable": true, "dtype": "float32", "L": 8, "heads": 4, "key_dims": 32, "hidden_units": [64, 32]}, "name": "transformer", "inbound_nodes": [[["patch_encoder", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_1", "inbound_nodes": [[["transformer", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["layer_normalization_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "MLP", "config": {"name": "mlp_1", "trainable": true, "dtype": "float32", "units": [2048, 1024], "rate": 0.5}, "name": "mlp_1", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 7, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["mlp_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_5", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}